import React from "react";

const State = () => {
  return (
    <div className="flex flex-col w-full h-full bg-white p-3 rounded-lg">
      <div>
          <h3 className="text-center text-xl mb-1 mt-1">🐈預購商品到貨須知</h3>
          <p>1、現貨商品、不同發售月份之預購商品請勿一起結帳。</p>
          <p>2、商品出貨時間將依照廠商、工作室的實際狀態為準，出貨時間僅供參考，，本店無法保證到貨日期，預購商品皆有延期之可能，若官方延期發售，恕不另行通知，敬請見諒。</p>
          <p>3、預購商品若有數量不足、延遲到貨等不可預知情形發生，貓車有訂單保留或取消之權利，官網會依照「付款」與「訂單成立時間」順序安排出貨。</p>
          <p>4、【預購商品圖】皆是廠商、工作室釋出之參考，請自行評估購買，恕不接受到貨後實物與圖片不符之退換貨服務。</p>
          <p>5.、客製化預購商品，下訂後不得取消，若因個人因素取消訂單，則沒收該筆訂單之訂金，不予退款。</p>
          <p>*如有未盡事宜，貓車保有調整及最終解釋權之權利。</p>
        </div>
        <div>
          <h3 className="text-center text-xl mb-1 mt-1">🐈商品狀況須知</h3>
          <p>１、為了避免糾紛，本賣場的注意事項請先詳讀。</p>
          <p>２、賣場商品皆為正版，請安心服用。</p>
          <p>３、長途運輸有碰撞擠壓之狀況，造成盒壓盒損之風險，盒況不一定完美，請下單朋友們互相體諒能接受再下單。</p>
          <p>４、全新商品我們無法進行拆盒查看狀況，塗裝瑕疵、溢色、掉漆、卡榫較鬆等情形均屬原廠檢驗合格之標準，本賣場不接受此原因之退換貨，完美主義者請慎重考慮再下單。</p>
          <p>５、本賣場出貨會妥善包裝好出貨，做足保護商品措施，但因暴力物流所造成的盒損並非我方可控制，希望各位朋友體諒。</p>
          <p>６、網路購物建議全程錄影開箱，以保障您的權利。</p>
          <p className="text-center mt-1">－－－下單一律視為同意以上聲明－－－</p>
        </div>
    </div>
  );
};

export default State;
